National_bank_xml/PRISTIGAO_MT102.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>DBXkUWLRas/K8Sn6lu+HYacA+z+ljaWjyiR+aIx8raj0yDrRdRSEDEBYKI4uCwJn9aGeM72AZGI2&#13;
Q3sf1oECwSAciQ9hkCV6heZ+S/FK0gfhKt5dmB5hgeFaSEL8UVYPEWIVAOAOJuoisaUcFTb+e0Kh&#13;
YSAU5xVgquxrfKIYrNkmOig0FNvH0GQSLADBteuqWzdIaV7RydCfcN/MDavf2CqYazUz0FC939nY&#13;
p/LhbDQlZIXwgaEWRl7cGnskqgASlh/kxcMrWROhs6ulDXFbIq5qaim8LIKn0TjYJ5vvLOqKCpcc&#13;
28VfSxtEdWc7HfGR5yjMcvL6uqaBX1ZjdJ1GpQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>f+I5bWDwEvaelfpwKBvnP2+XswbqfViVR5j0o18QktAJMAUmUE2Nh+xkOpiOTcAUAGLB3WvD0jpC&#13;
dSnMQcOvkrCBI3sD10ECK1rEibbkiLoYMAuThAkUmoX/kJPuNJF8tuEwCwuBb38BhuUBp6B6A5Go&#13;
t4eA4s/MyUWA6JMuUpcYSNn5g0TujY4PtAmCZG/sY9GRYS6rd4YAhie6kaL5RjRQd//JIzhgJZ61&#13;
0f4HAnErwdkQ9+O13ckd/C80+wD+Oz3NEjx6Xz60otwHXsNPeLAvOPkfSWG0wg4Qg2o68xxaxNEP&#13;
Tly981j543D7mO6hMJsomQWj+S7Dr0uJOCsSMdqbgjHYLMXLBPmSAjIMhVv6hKaK33CZdIgVfueS&#13;
CFxXwyHvVn3gh0RIH8UXoK2vjNWxRIAc/S7+r+GcHz2H+tpSlNZJcxLqIImxPbRSPz7+OWWXOTIJ&#13;
cPLt8+CyBPdhhzpwLZQAKqjnWjiKHkPxlNskfTDd1DWFUsaw4TVMvM+dAi0EAnbN62XvtoYFbfki&#13;
7FuF417Dj45KHSRbLFJ5PSjbnhjV98cbIeNHTFjZQFFfrmXzBOHe0KDKs5DzUiZVtZaz5wYqINZb&#13;
vCg2+OrhkvKM420gkNjQpYiH17WIr0p6CpZ1xdpCowPpof3Qg2nIJJwfn6eSiFpAcHrjos2HW4Dj&#13;
/Vtw4TQ/sCnaq2mbATz3LMaVbiw4Fu7nvTx1ROPBvhmVCBB6xrimAKxlx1GcMBVrkEevYIKLYwtk&#13;
KhqkG9Meb6goSxC5qFryxJWsCkAlEgh07zC14Pxb5ZeXkXpMVvav3kOtPDPVkwEfh5n7+6rxF8mC&#13;
y1VFf1LCjyJDdSeJQLq2Zi2FTn8lIUINjBn0RRP2OnKl87zLvLYNnWJjk+k/fCielHPBoqsMuPhZ&#13;
0CGc2nPz+hRbRwBHzDwkKmsmqTJFHV7a9E82sVuCNdPMm0mWTrsRRE1HomJtlFUYtDJqNMJ3hEZl&#13;
rsIp6cvpfb/0VrPHZKg0EdUgBQBGV+aBrlrhEPws9YdZGxQqWhd23UKqkAH9jUjqfyszbb/KmJiy&#13;
zcSLx9pq9I/eju6Jc1kukkqlUEMRV5Y8olkuy7y52Rg5JMIE6BFAKCZTNHiFHmg2CflHTse/cROr&#13;
M0iBMTtmIXxZHDIFzxedLvecCf8edRS7hFVDJti62V81TZFwF4n+zQHIyh6j1zwC219SKAWlb9yo&#13;
jnhi1ASpNMzMaNhaOEPKHkxhMf6VWpbxeMw3SLWAwOw9MEKlYn2CCwHOR0OtgdIHeFy9/bJL9Ds5&#13;
ER5dB9ybvJdmnb96ugTS7RpCwwpmo+iNEDCHocAhs7Lquw0Utr/G1kThKp1X5NuyqFHojUgoqZaw&#13;
fo0O9zVijc1c9yumQHPs0DbdLuk2Pb09N+BlEqvHgVHxIHDl+isouFTbEVuUU8M+bl+6aNlhalwH&#13;
aab8vUkSx0pze+wMas65VX3Rzly7vAmxKTHCozmTGprW0HcHGCKJ2P8/zjWXHx81NbKgAOyqZp2x&#13;
pZBmaquV0VwX/qNGsSjv2/Q+TTg7km8+8yOGMQ27jTDUTTkZyzDXLelw7gGo6sheLhPC9MWfZLA9&#13;
HJtu/CA2dbpm3c2hzuRpRfDlvg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>1cVMb/aGY3AMEN0TyriBh2l+drA=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
QJrIoHafZF7KH0qgmYCfRBRZkPce9xhb2uIPA2v1FQLOBppQzA71mgo8RcMDG0rj3YDxdWTmjx5J&#13;
H8dsSOcdvm0R35704ORU7Kt+RmxOqwTg6qxXpMY/rDds8uIoeov/IarrIiPBQCUFn97Uz1VYtRK7&#13;
wBDsLDZrdYwBS1iIC5uMFMurBkHiJN2yCdVk3Y8VpJ3u/iFFxzIGikczaqARn7dskD0ofBcQpKBC&#13;
toGH2L9atf1khvOjXlifEnGBfqK25zCwRYnBZUF2+UaRSndFrBfBKyS+opjMSvMNZSSWzbFoKYGh&#13;
BAlRtWw4jR0qMG8xJ/qO9RA3Ya2WzQ+2/NTTlA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>